/*	Задание 06. Chess & Knight
*
*	Шахматный конь (chess knight) ходит буквой “Г” — на две клетки по вертикали в любом направлении
*	и на одну клетку по горизонтали, или наоборот.
*	Даны две различные клетки шахматной доски, определите, может ли конь попасть
*	с первой клетки на вторую одним ходом.
*
*	Формат входных данных [input]
*	Функция принимает на вход четыре числа от 1 до 8 каждое,
*	задающие номер столбца и номер строки сначала для первой клетки (x1, y1),
*	потом для второй клетки (x2, y2).
*
*	Формат выходных данных [output]
*	Программа должна вывести "YES", если из первой клетки (x1, y1) ходом коня
*	можно попасть во вторую (x2, y2) или "NO" в противном случае.
*
*	[Sample function input 1] (пример передаваемых в функцию параметров): 4 4 4 5
*	[Sample function output 1] (пример возвращаемого функцией результата): NO
*
*	[Sample function input 2] (пример передаваемых в функцию параметров): 3 6 2 4
*	[Sample function output 2] (пример возвращаемого функцией результата): YES
*/

#include "Tasks.h"

string task06(int x1, int y1, int x2, int y2) {
	return "?";
}